Revit 2015 API
PathReinforcement.Create Method (Document, Element, IList<Curve>, Boolean)
 Creates a new PathReinforcement object from an array of curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015. Use the Create() method that accepts additional arguments (the id of the PathReinforcementType, RebarBarType, and RebarHookType).")]
public static PathReinforcement Create(
	Document document,
	Element hostElement,
	IList<Curve> curveArray,
	bool flip
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015. Use the Create() method that accepts additional arguments (the id of the PathReinforcementType, RebarBarType, and RebarHookType).")> _
Public Shared Function Create ( _
	document As Document, _
	hostElement As Element, _
	curveArray As IList(Of Curve), _
	flip As Boolean _
) As PathReinforcement
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015. Use the Create() method that accepts additional arguments (the id of the PathReinforcementType, RebarBarType, and RebarHookType).")]
public:
static PathReinforcement^ Create(
	Document^ document,
	Element^ hostElement,
	IList<Curve^>^ curveArray,
	bool flip
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
hostElement
Type: Autodesk.Revit.DB.Element
 The element that will host the PathReinforcement. The host can be either a Structural Floor or Structural Wall.
curveArray
Type: System.Collections.Generic.IList<Curve>
 An array of curves that will define the outline of the PathReinforcement.
flip
Type: System.Boolean
 A flag controlling the bars relative to the curves.
Return Value
 The newly created PathReinforcement.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curveArray is empty. -or- The input curveArray contains at least one helical curve and is not supported for this operation. -or- The document document does not contain the element hostElement -or- the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet. -or- curves in curveArray are not continuous and open.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
See Also
PathReinforcement Class
Create Overload
Autodesk.Revit.DB.Structure Namespace